#### Note

Use tripple quote , to activate indentation,
otherwise have to write all the queries in single line

#### Connecting to clever cloud mysql

In [28]:
#!pip3 install mysql-connector-python

In [4]:
import mysql.connector 
from mysql.connector import Error
import pandas as pd

In [5]:
connection = mysql.connector.connect(
  host="bybz54wnxrpm7fu13bib-mysql.services.clever-cloud.com", # replace username, hostname, password and database name appropriately
  user="u5bzf3s3fpxkrg5t",
  password="X6CUkrBLPGlozcFG7N9u",
  database="bybz54wnxrpm7fu13bib"
)

cursor1 = connection.cursor()

## IMPORT DATA FROM A CSV TO MYSQL

###### Step_0 : Load the CSV file using pandas

In [140]:
df = pd.read_csv('titanic_train.csv')
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [141]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [142]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

###### Setp_1 : Creating a Table in DB name Table_1

In [143]:
cursor1.execute("CREATE TABLE table_2 (Name VARCHAR(255), Sex VARCHAR(255))")

ProgrammingError: 1050 (42S01): Table 'table_2' already exists

###### Setp2 :Inserting data to the table Table_1

In [144]:
df1=df[['Name','Sex']]
for row in df1.iterrows():
    #print( row[1].values)
    sql="INSERT INTO table_2 (Name,Sex) VALUES (%s ,%s)"  #insert a single tuple
    val=tuple(row[1].values)
    cursor1.execute(sql,val)

###### LOADING THE DATA FROM THE TABLE

In [155]:
cursor1.execute('''SELECT * 
                 FROM table_2
                 where name like '%Dr.%'
                 ''')
result2=cursor1.fetchall()   #fetch all the tuple

for i in result2:
    print(i)

('Minahan, Dr. William Edward', 'male')
('Moraweck, Dr. Ernest', 'male')
('Pain, Dr. Alfred', 'male')
('Stahelin-Maeglin, Dr. Max', 'male')
('Frauenthal, Dr. Henry William', 'male')
('Brewe, Dr. Arthur Jackson', 'male')
('Leader, Dr. Alice (Farnham)', 'female')

##### CHECK THE NUMBER OF TABLE IN THE DB

In [108]:
cursor1.execute("SHOW TABLES")

for x in cursor1:
    print(x)

('Table_1',)
('table_2',)
('train',)

In [5]:
#cursor1.execute("CREATE TABLE subject (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), teacher VARCHAR(255))")

In [6]:
#cursor1.execute("ALTER TABLE Test_table ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

In [5]:
#cursor1.execute("ALTER TABLE Test_table  AUTO_INCREMENT=0")

## INSERT INDIVITUAL TUPLE OR ROW TO DB TABLE

In [9]:
cursor1.execute("CREATE TABLE table_1 (Name VARCHAR(255), place VARCHAR(255))")

#### INSERT TUPLES INTO THE DF

In [12]:
sql="INSERT INTO table_1 (name,place) VALUES (%s ,%s)"  #insert a single tuple
val=('Kc','Pune')

cursor1.execute(sql,val)

In [13]:
connection.commit()
print(cursor1.rowcount,"tuple inserted")

1 tuple inserted

In [14]:
cursor1.execute()

TypeError: execute() missing 1 required positional argument: 'operation'

In [17]:
#cursor1 = connection.cursor()
sql="INSERT INTO table_1 (name,place) VALUES (%s,%s)"

val=[('cc','Cov'),
    ('Skc','Cov')]

cursor1.executemany(sql,val)

In [18]:
print(cursor1.rowcount,'tuple were inserted')

2 tuple were inserted

## DATA SELECTION USING PYTHON IN MYSQL

#### SELECT DATA FROM A TABLE

In [82]:
cursor1.execute("SELECT * FROM table_1")

In [83]:
result1 =cursor1.fetchone()   #fetch the first tuple
print(result1)

('male', 'a')

In [84]:
result2=cursor1.fetchall()   #fetch all the tuple

for i in result2:
    print(i)

('male', 'b')
('female', 'c')
('male', 'd')
('female', 'e')

In [19]:
cursor1.execute("SELECT name FROM table_1")

myresult3 =cursor1.fetchall()

for i in myresult3:
    print(i)

('Kc',)
('cc',)
('Skc',)

In [21]:
cursor1.execute('''SELECT place,name 
                FROM table_1
               ''')

myresult4 =cursor1.fetchall()

for i in myresult4:
    print(i)

('Pune', 'Kc')
('Cov', 'cc')
('Cov', 'Skc')

In [23]:
cursor1.execute("SELECT name ,place FROM table_1")
myresult5 =cursor1.fetchall()

for i in myresult5:
    print(i)

('Kc', 'Pune')
('cc', 'Cov')
('Skc', 'Cov')

#### Limit the Display

In [24]:
cursor1.execute( "SELECT * FROM table_1 LIMIT 2")  #show only two results

result2 =cursor1.fetchall()

for x in result2:
    print(x)

('Kc', 'Pune')
('cc', 'Cov')

#### Filter Application

In [27]:
funct1="SELECT name ,place FROM table_1 WHERE name ='Kc'"

cursor1.execute(funct1)
result_6 =cursor1.fetchall()

for i in result_6:
    print(i)

('Kc', 'Pune')

In [28]:
print(result_6)

[('Kc', 'Pune')]

#### Delete Tuples

In [29]:
funct2= "DELETE FROM table_1 WHERE name ='Kc'"

cursor1.execute(funct2)

print(cursor1.rowcount, "are delected")

1 are delected

#### Fetch Data with Filter

In [30]:
funct4="SELECT count(*) FROM table_1 WHERE name ='cc'"

cursor1.execute(funct4)

result4=cursor1.fetchall()

for i in result4:
    print(i)

(1,)

#### Table Updation

In [34]:
funct5="UPDATE table_1 SET name ='ckc' WHERE name ='cc'"

cursor1.execute(funct5)

print(cursor1.rowcount, 'are affected')

1 are affected

In [35]:
#to check the table for changes
funt1="SELECT name ,place FROM table_1 "
cursor1.execute(funt1)
result_6 =cursor1.fetchall()

for i in result_6:
    print(i)

('ckc', 'Cov')
('Skc', 'Cov')

#### Count the data in the Table

In [36]:
filt3= "SELECT count(*) FROM table_1"

cursor1.execute(filt3)

result3 =cursor1.fetchall()

for x in result3:
        print(x)

(2,)

#### CONVERT INTO PANDAS DF FOR ANALYSIS

In [37]:
print(result2)

[('Kc', 'Pune'), ('cc', 'Cov')]

In [38]:
col1=list(zip(result2))  #this is just to show the difference of list creation without the * in the command
col1

[(('Kc', 'Pune'),), (('cc', 'Cov'),)]

In [39]:
col2=list(zip(*result2))
col2

[('Kc', 'cc'), ('Pune', 'Cov')]

In [40]:
df=pd.DataFrame({'name':col2[0],'address':col2[1]})

In [41]:
df

  name address
0   Kc    Pune
1   cc     Cov

#### Table Delection

In [81]:
funct6= "DROP TABLE subject "
#funct6 ="DROP TABLE IF EXISTS subject"
cursor1.execute(funct6)

In [82]:
#to display the table in db
cursor1.execute("SHOW TABLES") 

for x in cursor1:
    print(x)

('Test_table',)